@php use App\Models\Fundraising; @endphp
@extends('layouts.base')
@section('page_title', 'Плани розвитку проекту donater.com.ua')
@section('page_description', 'Roadmap розвитку donater.com.ua - опис всіх версій від початку до версій, які будуть доступні найближчим часом')
@section('og_image', url('/images/donater.com.ua.png'))
@section('og_image_width', '1200')
@section('og_image_height', '630')
@push('head-scripts')
    @vite(['resources/sass/timeline.scss'])
@endpush
@section('content')
    <div class="container">
        <h2 class="mb-3">Розвиток ресурсу donater.com.ua</h2>
        <section class="pb-4">
            <div class="border rounded-5">
                <section class="w-100 p-5">
                    <section class="">
                        <ul class="timeline-with-icons">
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-rocket-fill text-primary"></i>
                                </span>
                                <h5 class="fw-bold">Ідея ver.0.0.0</h5>
                                <p class="text-muted mb-2 fw-bold">16 листопада 2023</p>
                                <p class="text-muted">
                                    Все починалося з ідеї зробити сайт, який дозволить показати свої донати (не суми, а
                                    регулярність) і при цьому залишитись анонімом.
                                </p>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-gear-fill text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.1</h5>
                                <p class="text-muted mb-2 fw-bold">18 листопада 2023</p>
                                <p class="text-muted">
                                    Для перевірки ідеї було створено цей сайт. Щоб почати тестувати реалізовано:
                                </p>
                                <ol>
                                    <li>Авторизація через телеграм бот по коду</li>
                                    <li>Атоматичне створення акаунту з інформації яку надав телеграм</li>
                                    <li>Створення благодійний внесків з кодами, які треба писати в коментарі до донату
                                    </li>
                                    <li>Автоматична перевірка гугл таблиці з випискою, при наявності кода - валідувати
                                    </li>
                                    <li>Показувати посилання на банку та виписку в розділі звіти</li>
                                </ol>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-gear-wide-connected text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.2</h5>
                                <p class="text-muted mb-2 fw-bold">20 листопада 2023</p>
                                <p class="text-muted">
                                    Для більш зручного користування додано:
                                </p>
                                <ol>
                                    <li>Редагування профілю, зміна фото яке стягнуло з телеграм</li>
                                    <li>Покрокова інструкція для знайомства з функціоналом</li>
                                    <li>Виправлені помилки логіну, знайдені багі</li>
                                    <li>Додавання посилань на інші платформи (і видаленння)</li>
                                    <li>Створення цього роадмапу</li>
                                </ol>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-star-fill text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.3</h5>
                                <p class="text-muted mb-2 fw-bold">26 листопада 2023</p>
                                <p class="text-muted">
                                    Велике оновлення волонтерського функціоналу:
                                </p>
                                <ul>
                                    <li>Додавання нових зборів чи Фондів</li>
                                    <li>Редагування вже створених зборів</li>
                                    <li>Зупинити чи розпочати збір (виключає чи включає можливість створити благодійний
                                        внесок до збору)
                                    </li>
                                    <li>Сортування зборів по кількості донатів на збір</li>
                                    <li>Додана сторінка донатерів, які мають збори (волонтери)</li>
                                    <li>Додана можливість створити код будь якому донатеру з кодом на свій збір (для
                                        ситуацій коли донатер промахнувся та відправив донат без коду)
                                    </li>
                                </ul>
                                <p class="text-muted mt-3">
                                    Оновлення загального функціоналу:
                                </p>
                                <ul>
                                    <li>Зроблена посторінкова видача (pagination) там де це треба</li>
                                    <li>Зміна вигляду бейджів, додан бейдж створених зборів</li>
                                    <li>Редізайн сторінки донатера, додано блок зі створеними зборами</li>
                                    <li>Додана сторінка-фід донатів. Для олдов є rss feed</li>
                                </ul>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-boxes text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.4</h5>
                                <p class="text-muted mb-2 fw-bold">9 січня 2024</p>
                                <p class="text-muted">
                                    Велике оновлення, яке поступово викатувалося останній місяць:
                                </p>
                                <ul>
                                    <li>Розділ аналітики - загальна, до окремого збору, до окремого волонтера</li>
                                    <li>Сторінка довідки для питань-відповідей "як користуватися"</li>
                                    <li>
                                        Перероблена система кодів. Тепер один постійний код, який створює донат в момент
                                        додавання виписки. Також код - це посилання "запрошення" для волонтерів. Код
                                        можна додавати до всіх донатів, які ви робите. Якщо волонтер додасть виписку на
                                        сайт - ваши донати автоматично підтягнуться.
                                    </li>
                                    <li>
                                        Перероблени сторінки донатерів та донатів, прибрана зайва інформація, тепер
                                        лаконічно в таблічному вигляді
                                    </li>
                                    <li>
                                        Перероблене меню сайту, стало багато посилань, сховав деякі пункти в дропдауни
                                    </li>
                                    <li>
                                        Створена можливість додавати призи на сайт. Ці призи можна використати для
                                        розіграшів. Волонтер може самостійно створити призи на свій збір, або
                                        скористуватися призами, які додали інши донатери на сайт. Цей функціонал ще
                                        буде дороблятися. Буде краще зроблено по доступності призів, наприклад, призи
                                        які доступні тільки конкретному волонтеру. Також треба доробити часові рамки,
                                        при додаванні обирати час з якого буде йти розіграш (з моменту додавання, чи за
                                        весь період, чи кастомні дати початку та кінця розіграшу)
                                    </li>
                                </ul>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-stars text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.5</h5>
                                <p class="text-muted mb-2 fw-bold">15 січня 2024</p>
                                <p class="text-muted">
                                    Додано функціонал який дозволить підписатися на волонтера. Підписка працює щоденно.
                                    В обраний час телеграм бот присилає посилання на збір з обраною сумою та коментарем
                                    прямо в посиланні. Монобанк не підтримує прокидання суми меньше 100₴ В такому
                                    випадку суму придеться писати під час донату.
                                </p>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-stars text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.6</h5>
                                <p class="text-muted mb-2 fw-bold">20 березня 2024</p>
                                <p class="text-muted">
                                    Фокус сайту максимально змінився на підписки на волонтерів. Основна мета проекту
                                    потрохи рухається в напрямку краще 1000 людей по 3 гривні в день, ніж поодинокі
                                    донати в тисячи гривень. Також додано створення коротких посилань на сторінки
                                    зборів.
                                    Додано налаштування не отримувати маркетингові повідомлення, а також повідомлення
                                    про валідацію донатів, чи щотижневе нагадування підписатися на волонтерів,
                                    якщо такої підписки немає
                                </p>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-stars text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.7</h5>
                                <p class="text-muted mb-2 fw-bold">24 березня 2024</p>
                                <p class="text-muted">
                                    Повністтю перероблена система авторизації/реєстрації. Тепер це просто "підключити
                                    телегра бота". Всі кнопки "підписатися" доступні без авторизації, але ведуть в бота
                                    та автоматично роблять логін, щоб знизити кілкість кроків до підписки. Також додані
                                    всі пов'язані блоки в доступності одного кліку - підписатися на волонтера в
                                    будь-якому
                                    місці, че задонатити на збір в розділі призів, обрав приз який хочете виграти.
                                    Перероблен дізайн, щоб було зручніше користуватися, кліків до кожної дії стало не
                                    більше 2-3, а в деяких випадках - 1 клік. Додано налаштування "Використовувати
                                    фемінітиви, коли описують мою роль (волонтерка/донатерка)", але ще багато роботи де
                                    його треба додати його використання (щоб змінювало якщо опцію включена). Зроблена
                                    автогенерація картинок прев'ю посилання в соціальних мережах. Там мінімальна
                                    статистика користувача, якщо це посилання на юзера, а також зроблена автогенерація
                                    картинок прев'ю для посилань на збори. Замінено деякі дефолтні аватарки.
                                </p>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-stars text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.8</h5>
                                <p class="text-muted mb-2 fw-bold">28 березня 2024</p>
                                <p class="text-muted">
                                    Невеличке оновлення:
                                </p>
                                <ul>
                                    <li>Додана анлітика донатера (публічна). Додана анлітика по всім донатам
                                        користувачів в загальний розділ аналітики
                                    </li>
                                    <li>Видалено неактуальні налаштування</li>
                                    <li>Пофікшені всі баги з розгортанням блоків</li>
                                    <li>Пофікшен баг авторизації</li>
                                    <li>Додано налаштування "При відкритті профілів всі блоки окрім посилань будуть
                                        розгорнуті"
                                    </li>
                                    <li>Додано унікальні коди при донаті з нагадування. Це перший крок до прорахунку
                                        "надійності донатера". Це дозволить відслідковувати донати по підпісці, які в
                                        майбутньому будуть використані в математичній моделі "коли закриється мій збір"
                                        в функціоналі волонтера
                                    </li>
                                    <li>Пофікшені баги коли на сторінці кілька зборів, та волонтер натискає на кнопки
                                        призи чи коротке посилання окремого збору
                                    </li>
                                </ul>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-stars text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.9</h5>
                                <p class="text-muted mb-2 fw-bold">12 квітня 2024</p>
                                <p class="text-muted">
                                    Важливе оновлення:
                                </p>
                                <ul>
                                    <li>Видалено сторінки, які додавали сайту сенси, які не переслідуються загальною
                                        метою. Видалено "Донатери", "Волонтери". Сайт не агрегатор зборів. Сайт це
                                        допомога волонтерам та донатерам зробити донати регулярними та простими, по
                                        нагадуванню в телеграм бот
                                    </li>
                                    <li>Видалено неактуальні налаштування</li>
                                    <li>Додана можливість волонтерам створювати "діп-лінки". Це коротке посилання, яке
                                        веде в телеграм бота. Після натискання кнопки старт, чи автоматичного старту
                                        якщо це додаток, шукається існуючий користувач, або створюється новий, після
                                        цього автоматично створюється підписка на волонтера (який/яка створили діп-лінк)
                                        на щоденний донат в обрану годину з обраною сумою при створенні "діп-лінка".
                                        Таким чином можна в 1 клік отримати підписника, який можливо навіть ніколи не
                                        зайде на сайт, та буде отримувати щоденні нагадування донатити своєму волонтеру.
                                    </li>
                                    <li>
                                        Почалося тестування "траст-скору", або на скільки підписники виконують свою
                                        обіцянку донатити по підписці. Це дуже необхідний показник, які допоможе потім
                                        більш точніше прогнозувати надходження коштів волонтерам. Це дозволить
                                        волонтерам обіцяти постачальникам передоплату, оплату тощо в рамках терміну,
                                        за яким була домовленість
                                    </li>
                                    <li>
                                        Волонтерська аналітика на сторінці волонтера стала публічною
                                    </li>
                                    <li>
                                        Виправлено баги з аналітикою текстом
                                    </li>
                                    <li>
                                        Оновлення головної сторінки
                                    </li>
                                    <li>
                                        Оновлення розділу FAQ
                                    </li>
                                </ul>
                            </li>
                            <li class="timeline-item mb-5">
                                <span class="timeline-icon">
                                  <i class="bi bi-stars text-primary"></i>
                                </span>
                                <h5 class="fw-bold">MVP ідеї, ver.0.0.10</h5>
                                <p class="text-muted mb-2 fw-bold">десь в майбутньому</p>
                                <p class="text-muted">
                                    Планування майбутнього розвитку:
                                </p>
                                <ul>
                                    <li>Робити розіграши серед донатерів (буде багато)</li>
                                    <li>Волонтерський функціонал:</li>
                                    <ul>
                                        <li>Додавати документи до транзакцій з мінусом в виписці (доступ до цих
                                            документів буде мати тільки ті, хто донатив на збір, мають завалідований
                                            внесок)
                                        </li>
                                        <li>Налаштування персонального повідомлення в момент створення внеску, чи після
                                            валідації
                                        </li>
                                        <li>Дати можливість волонтеру писати своїм донатерам раз на добу повідомлення в
                                            бота
                                        </li>
                                        <li>Поступово прийти до ситуації коли ми маємо закритий збір - виписку бачуть
                                            всі,
                                            звіт по чекам який прив'язано до мінус транзакцій тількі ті, хто донатив.
                                            Волонтери можуть видалити весь цей шлак з телефону. Хочешь бачити всі звіти
                                            - донать. Без донату тільки виписка в тому форматі, як вона є зараз - сума
                                            донату та акаунт який знайшовся по коду коментаря
                                        </li>
                                    </ul>
                                    <li>Загальний функціонал:</li>
                                    <ul>
                                        <li>
                                            При наявності активної аудиторії - прогнозування збору. Якщо є донатери
                                            хто вже заповнив скільки тягне донатів, то це дозволить волонтеру бачити
                                            прогноз часу скільки треба щоб закрити збір. Це дозволить більш точно
                                            планувати збори та витрати на розхідники (авто, фпв, дрони)
                                        </li>
                                        <li>
                                            Максимально винести все в бота. Щоб на сайт ходили тільки по звіти,
                                            документи по звіту тощо.
                                        </li>
                                    </ul>
                                </ul>
                            </li>
                            <p class="text-muted lead">
                                ОСНОВНА МЕТА: зробити життя волонтерів аматорів простішим, дати ім інструмент який
                                дозволить якісніше взаємодіяти з донатерами, ділитися детальними звітами тільки з
                                донатерами збору, донатери мають планування донатів, працює планування закриття зборів
                                на базі виставлених донатерами планів.
                            </p>
                        </ul>
                    </section>
                </section>
            </div>
        </section>
    </div>
@endsection
