<p class="lead">
    donater.com.ua - платформа для волонтерів та донаторів, яка робить процес
    зборів більш прозорим, а накопичення коштів на потреби ЗСУ - стабільним.
</p>
<p>
    <strong>Коротко це той самий "лайк-підписка-дзвоник", де замість нового
        контенту вам приходить посилання на банку вашого волонтера/ки, з обраною
        вами сумою та за вашим розкладом.
    </strong>
</p>
<p>
    <strong>Якщо детально</strong>, то головна функція платформи - підписка на
    волонтера/ки з зазначенням прийнятної для донатора/ки суми та розкладом
    нагадувань. Коли волонтер/ки має відкритий збір, то донатори, що підписалися на
    нього, отримують нагадування з посиланням на банку зборів «свого» волонтера/ки.
    Таким чином донатори/ки можуть робити регулярні внески на актуальну банку
    волонтера. Що більше, нагадування вже має зашитий в посилання код донатора,
    що дає можливість побачити, від кого саме з донатерів надійшов внесок. А
    це важливо, адже платформа надає волонтерам можливість заохочувати своїх
    донаторів призами, які розігруються тільки серед донаторів сайту. До речі,
    донатори теж можуть пропонувати свої призи для зборів. Від волонтера/ки
    потрібно лише додати наявний приз до себе на збір. Також є можливість створити
    "діп-лінк" який в 1 клік зареєструє та створить підписку для волонтера/ки, донатери
    можуть навіть не заходити на сайт.
</p>
<p>
    <strong>Та головне!</strong> Платформу створено для забезпечення регулярного
    надсилання донатів. Сума значення не має. Набагато простіше планувати
    виробництво FPV, якщо маєш 3000 грн в день від 1000 людей, які регулярно
    надсилають 3грн (ми дуже вдячні за донат в 3грн, приведіть друзів, ми хочемо
    зробити донатерами всіх, хто здатен користуватися інтернетом), ніж очікувати
    на фінансування від поодинокого донатора/ки, який може задонатити (а може й ні)
    100к раз на місяць.
</p>
<p>
    Повний опис всього функціоналу в форматі треда твітера - <a
        href="https://x.com/setnemo/status/1749896475667026256?s=20"
        target="_blank">тут</a>. А якщо
    хочеться окремим лонгрідом - <a
        href="https://telegra.ph/donatercomua---podroboc%D1%96-proektu-01-23"
        target="_blank">тут</a>.
</p>
<p>
    Наразі сайт у відкритому бета-тесті. Плани розвитку сайту можна почитати в
    розділі <a href="{{ route('roadmap') }}" class="">Roadmap</a>.
</p>
